#include<stdio.h>

void print_menu()
{
   printf("\n-----------+---------------------+-----------+-----------+-----------+-----------+-----------+-----------+------------\n");
   printf("*                                                   Operation Menu                                                   *\n"); 
   printf("*                                             1、新添加一个零件                                                      *\n"); 
   printf("*                                             2、为指定零件增加采购                                                  *\n"); 
   printf("*                                             3、销售库存中的零件                                                    *\n"); 
   printf("*                                             4、删除库存中的零件                                                    *\n"); 
   printf("*                                             5、展示零件的详细信息                                                  *\n"); 
   printf("*                                             6、打印所有零件的详细信息                                              *\n"); 
   printf("*                                             7、结束操作                                                            *\n"); 
   printf("-----------+---------------------+-----------+-----------+-----------+-----------+-----------+-----------+------------\n");
}
